/************************************************************************************
**                             淮阴工学院 机器人协会                             ****
**                                     大 胡                                     ****
**                              All Rights Reserved                              ****
************************************************************************************/

//最新版本2015.8.3
#include "main.h"


void SPI_SlaveInit(void)
{
	/*PC5(SPI_CSK),PC6(SPI_MOSI)上拉输入,PC7(SPI_MISO)推挽输出*/
	PC_DDR|=(1<<7);
	PC_CR1|=(1<<5)|(1<<6)|(1<<7);
		/*LSBFIRST=0高位数据在前,波特率为f/4，MSTR=0为从机
	数据传输和串行时钟选择CPOL和CPHA都为0*/
	
	/*NSS由软件配置，并设置为从机*/
	SPI_CR2=0x02;
	
	SPI_ICR|=0b01100000;//开接收缓冲器非空中断，错误中断使能
	
	SPI_CR2|=0x20;
	
		/*使能SPI*/
	SPI_CR1|=0x40;
}

