/************************************************************************************
**                             淮阴工学院 机器人协会                             ****
**                                     大 胡                                     ****
**                              All Rights Reserved                              ****
************************************************************************************/

//最新版本2015.8.3
#include "main.h"


void SPI_MasterInit(void)
{
	/*PC5(SPI_CSK),PC6(SPI_MOSI)推挽输出,PC7(SPI_MISO)上拉输入*/
	PC_DDR|=(1<<5)|(1<<6);
	PC_CR1|=(1<<5)|(1<<6)|(1<<7);
	/*LSBFIRST=0高位数据在前,波特率为f/4，MSTR=1为主机，
	数据传输和串行时钟选择CPOL和CPHA都为0*/
	SPI_CR1=0x0c;
	/*NSS由软件配置，并设置为主机*/
	SPI_CR2=0x03;
	
	SPI_CR2|=0b00100000;
	/*使能SPI*/
	SPI_CR1|=0x40;
}